Repository: ro-msg-angular-training/online-shop-career-start-2022-JurjiuDarius
Catalog: online-shop/src/locale/messages.*.xlf
Languages: ro

# Products-add
source: Add a new product
ro: Adaugti un produs nou

# Products-category
source: Category: {{ product.category }}
ro: Categorie:

# Products-loading
source: Loading page...
ro: Se incarca

# Title
source: Online shop
ro: Magazin online

source: Home
ro: Acasa

# To cart
source: Go to cart
ro: Cos

source: Log in
ro: Logare

source: Log Out
ro: Delogare

# Login-username
source: Username:
ro: Nume utilizatior:

# Login-password
source: Password:
ro: Parola:

# Login-loading
source: Loading page...
ro: Se incarca...

# Login-error
source: Error logging in.
ro: Eroare la logare.

# Cart-category
source: Category: {{ product.category }}
ro: Categorie

# Cart-loading
source: Loading page...
ro: Se incarca...

# Cart-processing
source: Processing...
ro: In curs de procesare...

# Cart-error
source: An error has occured.
ro: Eroare.

# Cart-checkout
source: Check out
ro: Plasare comanda

# Edit-name
source: Name
ro: Nume

# Edit-required
source: The field is required
ro: Campul este necesar

# Edit-short
source: Too short!
ro: Prea scurt!

# Edit-long
source: Too long!
ro: Prea lung!

# Edit-category
source: Category
ro: Categorie

# Edit-price
source: Price
ro: Pret

# Edit-small
source: Number is too small!
ro: Numarul este prea mic!

# Edit-big
source: Number is too big!
ro: Numarul este prea mare!

# Edit-description
source: Description
ro: Descriere

# Edit-image
source: Image URL
ro: URL imagine

# Detail-category
source: Category: {{ product.category }}
ro: Categorie:

# Detail-backToAll
source: Back to all products
ro: Inapoi la produse

source: Add to cart
ro: Adaugati produsul in cos

# Delete
source: Delete this product
ro: Stergere produs

# Detail-loading
source: Page is loading...
ro: Se incarca...

# Detail-error
source: An error has occured.
ro: Eroare
